In [14]:
from pymongo import MongoClient
client = MongoClient("localhost:27017")
client

MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True)

In [15]:
db = client.get_database("ironhack")

In [16]:
from pymongo import GEOSPHERE

In [13]:
import requests
import json
from dotenv import load_dotenv
import os
import pandas as pd
load_dotenv()

True

In [5]:
ranking = pd.read_csv('../data/ranking', index_col = 0)

In [8]:
ranking

         requirement  requirement_value
8               ocio              44.20
0            colegio              13.26
1   Design Companies               8.24
2      Airport-Train               7.84
3       1M companies               6.76
4           Starbuck               6.27
5  peluqueria_canina               5.00
6              Vegan               1.96
7     Basket Stadium               0.37

In [11]:
empresas_ciudad = pd.read_csv('../data/empresas_ciudad', index_col = 0)

In [12]:
empresas_ciudad

                 Madrid                 Barcelona          Montreal  Lisboa
0                   Fon                  Splendia   Airborne Mobile  Nexway
1             eRepublik                 Futurlink           Mobivox     NaN
2                 Busuu                 Openbravo       Radialpoint     NaN
3  Unkasoft Advergaming                  UserZoom             Akoha     NaN
4                Nexway                     Veeva       MediaScrape     NaN
5   Tuenti Technologies                   Teambox         StatusNet     NaN
6           Virgin Play  International Sportsbook  Trellia Networks     NaN
7              ticketea                       NaN               NaN     NaN
8               Genasys                       NaN               NaN     NaN
9                BuyVIP                       NaN               NaN     NaN

In [17]:
coordenadas_ciudades = {'madrid' : [40.42741669687324, -3.7042628540907128],
                        'barcelona' : [41.38673290105267, 2.1734030691967905],
                        'lisboa' : [38.72287648728543, -9.139444396944034],
                        'montreal' : [45.51073484608754, -73.56393413888645]}